import * as AppSettings from "./app-settings.json";
import * as Users from "./users.json";

export class Configuration {
  appSettings: typeof AppSettings;
  users: typeof Users;
  readonly categories: string[];
  readonly riskcodeCategories: string[];

  constructor() {
    this.appSettings = AppSettings;
    this.users = Users;

    this.categories = [
      'ตัวเลือกยอดนิยม',
      'อาคารและสถานที่อยู่อาศัย',
      'ร้านค้าและบริการ',
      'โรงพยาบาลและสถานพยาบาล',
      'โรงงานและอุตสาหกรรม',
      'โกดังเก็บสินค้า',
      'การเกษตรและปศุสัตว์',
      'ตลาดและสถานที่ค้าขาย',
      'สถานที่บันเทิงและสันทนาการ',
      'สถานที่ราชการและการศึกษา',
      'ศาสนาและวัฒนธรรม',
      'เทคโนโลยีและโครงสร้างพื้นฐานดิจิทัล',
      'สถานที่ราชการและธนาคาร',
      'พลังงานและสถานีบริการเชื้อเพลิง',
      'อื่นๆ',
    ];

    this.riskcodeCategories = [
      '1001 - โกดังเก็บปอ',
      '1002 - โกดังเก็บกระสอบป่าน',
      '1003 - ร้านกาแฟ', 
      '1004 - โรงเก็บเครื่องบิน (ไม่ประกอบการพ่นสี)',
      '1005 - โรงเก็บเครื่องบิน (มีประกอบการพ่นสี)',
      '1006 - โกดังเก็บสินค้าไม่อันตราย',
      '1007 - โกดัง-เก็บสินค้าอันตรายตามข้อรับรอง 49',
      '1008 - โกดัง-เก็บสินค้าอันตรายตามข้อรับรอง 50',
      '1009 - โกดัง-เก็บสินค้าอันตรายตามข้อรับรอง 51',
      '1010 - โกดัง-เก็บสินค้าอันตรายโดยไม่มีข้อรับรอง',
      '1011 - โกดังเก็บเฉพาะเหล็กเส้น เส้นลวดหนาม แผ่นสังกะสี',
      '1012 - คลีนิก สถานบริการสุขภาพและความงาม',
      '1013 - คอก เล้าปศุสัตว์',
      '1014 - คาบาเรทหรือไนท์คลับ',
      '1015 - ร้านค้าย่อย-มีข้อรับรองที่ 48',
      '1016 - ร้านค้าย่อย-มีข้อรับรองที่ 49',
      '1017 - โรงรับจำนำ',
      '1018 - ชุมสายโทรศัพท์',
      '1019 - ร้านซักรีด อบ หรือซักแห้ง',
      '1020 - ร้านตัดผม หรือห้องเสริมสวย นวดตัว สปา',
      '1021 - สถานบริบาลเด็ก ผู้สูงอายุ',
      '1022 - ตลาด (ภายในตลาดไม่มีการกั้นห้อง)',
      '1023 - ตลาด (ภายในตลาดกั้นห้องด้วยวัสดุทนไฟหรือกึ่งทนไฟ)',
      '1024 - ถังเก็บน้ำมันเชื้อเพลิง (ตามข้อรับรองที่ 7)',
      '1025 - ถังเก็บน้ำมันเชื้อเพลิง (ตามข้อรับรองที่ 8)',
      '1026 - ถังเก็บน้ำมันเชื้อเพลิง-อื่น ๆ',
      '1027 - ร้านถ่ายรูป',
      '1028 - คลีนิคทันตแพทย์',
      '1029 - สำนักงานธนาคาร ธุรกรรมด้านการเงิน',
      '1030 - สถานีอัดฉีดและบริการน้ำมัน',
      '1031 - สถานบันเทิง',
      '1032 - บ้านอยู่อาศัย',
      '1033 - บาร์',
      '1034 - ห้องบิลเลียด',
      '1035 - สถานโบวล์ลิ่ง',
      '1036 - โบสถ์',
      '1037 - การประปา',
      '1038 - โรงพยาบาล',
      '1039 - ฟาร์ม โรงเลี้ยงปศุสัตว์',
      '1040 - แฟลตหรือหอพัก',
      '1041 - โรงไฟฟ้า',
      '1042 - ร้านซ่อมแซมเครื่องไฟฟ้า',
      '1043 - ภัตตาคาร',
      '1044 - โรงภาพยนต์ (มีห้องเก็บฟิล์มต่างหาก)',
      '1045 - โรงภาพยนต์-อื่น ๆ',
      '1046 - โรงถ่ายภาพยนต์',
      '1047 - โรงมหรสพ (ยกเว้นโรงภาพยนต์)',
      '1048 - อู่หรือศูนย์บริการรถยนต์ (ไม่มีการซ่อม และพ่นสี)',
      '1049 - โรงเก็บรถยนต์โดยสารที่เก็บอยู่ ณ สถานที่เก็บรถและใช้วิ่งอยู่ประจำเส้นทางต่างๆ (ไม่รวมเพลิงไหม้ เนื่องจากการชนกัน)',
      '1050 - โรงเรียน',
      '1051 - โรงแรม',
      '1052 - อู่เรือ (ไม่มีการสร้างหรือการซ่อมแซม)',
      '1053 - โรงเลหลัง',
      '1054 - วัด',
      '1055 - วิทยาลัย',
      '1056 - สถานีรถไฟ หรือสถานีรถโดยสาร',
      '1057 - สถานีรับ-ส่งวิทยุ',
      '1058 - สถานีรับ-ส่งโทรทัศน์',
      '1059 - สถานที่ทำการของหน่วยราชการ',
      '1060 - สะพานเทียบท่า',
      '1061 - สมาคมหรือสโมสร (ไม่รวมถึงไนค์คลับหรือคาบาเรท)',
      '1062 - สำนักงาน',
      '1063 - สินค้าในที่โล่ง ไม่มีอันตราย',
      '1064 - สินค้าในที่โล่งมีอันตราย ไม่รวมปอ นุ่น',
      '1065 - สถานที่แสดงสินค้า',
      '1066 - โรงหม้อน้ำ',
      '1067 - ห้องเย็น (มีข้อรับรอง 33)',
      '1068 - ห้องเย็น (มีข้อรับรอง 34)',
      '1069 - อาคารในระหว่างก่อสร้าง (จำนวนเอาประกันภัยตามมูลค่าที่ได้สร้างขึ้นแล้ว)',
      '1069 - อาคารในระหว่างก่อสร้าง (จำนวนเอาประกันภัยตามมูลค่าที่สร้างเสร็จแล้ว)',
      '1070 - อาคารสาธารณะ',
      '1071 - สถานที่ อาบ อบ นวด',
      '1072 - ร้านอาหาร',
      '1074 - บ้านอยู่อาศัย หมู่บ้านจัดสรรในส่วนภูมิภาค'
    ];
  }
}
